# 7. 데이터 선택 (loc)
이름을 이용하여 원하는 row에서 원하는 col 선택

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = '지원번호')
df

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [2]:
df.loc['1번'] # index 1번에 해당하는 전체 데이터

이름         강민수
학교         세종초
국어         100
영어          85
수학         100
과학          85
사회         100
SW특기    Python
Name: 1번, dtype: object

In [3]:
df.loc['4번'] # index 4번에 해당하는 전체 데이터

이름      정태경
학교      덕소초
국어       85
영어      100
수학       85
과학      100
사회       85
SW특기    NaN
Name: 4번, dtype: object

In [4]:
df.loc['1번', '국어'] # index 1번에 해당하는 국어 데이터

100

In [5]:
df.loc[['1번', '2번'], '영어'] # index 1번, 2번에 해당하는 영어 데이터

지원번호
1번    85
2번    90
Name: 영어, dtype: int64

In [6]:
df.loc[['1번', '2번'],['영어', '수학']] # index 1번, 2번에 해당하는 영어, 수학 데이터

      영어   수학
지원번호
1번    85  100
2번    90   95

In [7]:
df.loc['1번' : '3번', '국어' : '사회'] # index 1번부터 3번까지, 국어부터 사회까지 데이터

       국어  영어   수학  과학   사회
지원번호
1번    100  85  100  85  100
2번     95  90   95  90   95
3번     90  95   90  95   90